# Taps
tap "homebrew/services"
tap "homebrew/cask-fonts"

# Development Tools
brew "go"
brew "maven"
brew "node"
brew "openjdk"
brew "python@3.14"
brew "ruby"

# Git & GitHub
brew "git"
brew "git-delta"
brew "git-extras"
brew "git-lfs"
brew "glab"

# Kubernetes & Cloud
brew "argocd"
brew "helm"
brew "kubernetes-cli"
brew "tailscale"

# CLI Tools
brew "asciinema"
brew "bat"
brew "btop"
brew "eza"
brew "fd"
brew "fzf"
brew "htop"
brew "lazygit"
brew "lsd"
brew "mole"
brew "nmap"
brew "ripgrep"
brew "the_silver_searcher"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "watch"
brew "zoxide"

# Utils
brew "bash-completion"
brew "cloudflared"
brew "cmake"
brew "coreutils"
brew "curl"
brew "gettext"
brew "gnupg"
brew "gpg"
brew "pinentry"
brew "pipx"
brew "reattach-to-user-namespace"
brew "telnet"
brew "translate-shell"
brew "unzip"
brew "vim"
brew "wget"

# LLM/AI
brew "hf"
brew "llama.cpp"
brew "llmfit"

# Casks
cask "brave-browser"
cask "bruno"
cask "charles"
cask "gcloud-cli"
cask "obsidian"
cask "raycast"
cask "rectangle"
cask "visual-studio-code"
